/***
 * 车险字段Bean
 ***/
define(function () {
   'use strict';
   var app = angular.module('app.car.beans', []).factory('$carBeansService', ['$rootScope', function ($rootScope) {

      //Token 临时
      $rootScope.TOKEN = '9A6B5FE1EDB9439C96E80AA4B63DDA21';

      $rootScope.BASE_BEAN = {
         //第三者责任险保额对象
         LIABILITY_INS: [5, 10, 15, 20, 30, 50, 100, 150, 200, 250, 300, 350, 400, 450, 500],
         //司机座位险
         DRIVER_SEAT: [1, 2, 3, 4, 5, 10, 15, 20],
         //乘客座位险
         PASSENGER_SEAT: [1, 2, 3, 4, 5, 10, 15, 20],
         //刮痕险
         SCRATCH_INS: [0.2, 0.5, 1, 2]
      };

      $rootScope.CAR_BEANS = {
         //--------------------------------------begin 续保信息--------------------------------------/
         /** 续保查询保单号 */
         XB_QUERY_PLY_NO: "",
         /** 续保查询车牌号 */
         XB_QUERY_ECHILE_NO: "",
         /** 续保查询车架号 */
         XB_QUERY_VIN_NO: "",
         //--------------------------------------end   续保信息--------------------------------------/

         //--------------------------------------begin 个代信息--------------------------------------/
         //是否选择个贷
         IS_CMPNY_AGT: false,
         //--------------------------------------end   个代信息--------------------------------------/

         //--------------------------------------begin 车主信息--------------------------------------/
         /** 车主姓名 */
         DRV_OWNER: "王涛",
         /** 车主证件类型 */
         CERTI_TYPE: "120001",
         /** 车主证件号码 */
         CERTI_CODE: "420626199310064532",
         /** 车主电话号码 */
         CERTI_TEL: "18026905016",
         /** 车主邮箱 */
         OWER_EMAIL: "",
         /** 1.投保人同车主 2.被保人同车主 3投被保人都不同车主 4投保人被保人都同车主*/
         VISIBLE_NO: "4",
         //--------------------------------------end   车主信息--------------------------------------/

         //--------------------------------------begin 投保人信息--------------------------------------/
         /** 投保人姓名 */
         APP_NME: "西沙测",
         /** 投保人证件类型 */
         APP_CERT_TYPE: "120001",
         /** 投保人证件号码 */
         APP_CERT_NO: "420683198705065436",
         /** 投保人联系人电话 */
         APP_TEL: "13628707956",
         /** 投保人地址 */
         APP_ADDR: "",
         /** 投保人邮箱 */
         EMAIL_APP: "",
         //--------------------------------------end  投保人信息--------------------------------------/

         //--------------------------------------begin 被保人信息--------------------------------------/
         /** 被保险人姓名 */
         INSRNT_CNM: "西沙测",
         /** 被保人证件类型 */
         BIZ_CERT_TYPE: "120001",
         /** 被保人证件号码 */
         BIZ_CERT_NO: "420683198705065436",
         /** 被保险人电话 */
         INSRNT_TEL: "13628707956",
         /** 被保险人地址 */
         INSRNT_ADDR: "",
         /** 被保险人邮箱*/
         EMAIL: "",
         //--------------------------------------end  被保人信息--------------------------------------/

         //--------------------------------------begin  投保人被保人车主关系信息--------------------------------------/
         /**投保人同车主    */
         appIsDrvOwner: "1",
         /**被保人同车主    */
         insrntIsDrvOwner: "1",
         //--------------------------------------end  投保人被保人车主关系信息--------------------------------------/

         //--------------------------------------begin  业务员信息--------------------------------------/
         SLS_CDE: "105026943",
         //--------------------------------------end    业务员信息--------------------------------------/

         //--------------------------------------begin  车辆信息--------------------------------------/
         /** 车牌号码 */
         LCN_NO: "粤B60260",
         /** 发动机号 */
         ENG_NO: "6026989632",
         /** 车架号/VIN码 */
         VHL_FRM: "LSVAM4187C2184847",
         /**车型代码 */
         BRND_CDE: "LYD1032SHD",
         /**   打印厂牌车型 */
         BRND_NME_OTHER: "",
         /**品牌类型 */
         VEHICLE_NAME: "朗逸SVW7167MSD 品悠版",
         /** 初次登记日期 */
         REGISTER_DATE: "2016-08-10",
         /** 过户车标志 */
         CHGOWNERFLAG: "0",
         /** 转移登记日期 */
         TRANSFERDATE: "",
         /** 玻璃类型 */
         GLASS_TYPE: "303011001",
         //--------------------------------------end  车辆信息--------------------------------------/


         //--------------------------------------begin 保险起止期--------------------------------------/
         /** 商业险保险起止期 */
         INSRNC_BGN_TM: "2016-11-05 00:00",
         INSRNC_END_TM: "2017-11-04 23:59:59",
         /** 交强险保险起止期 */
         INSRNC_BGN_TM_JQ: "2016-11-05 00:00",
         INSRNC_END_TM_JQ: "2017-11-04 23:59:59",
         /** 商业险既时生效  */
         SY_IS_IMMEFC: "0",
         /** 交强险既时生效  */
         JQ_IS_IMMEFC: "0",
         //--------------------------------------end   保险起止期--------------------------------------/


         //--------------------------------------begin  报价信息--------------------------------------/
         /** 是否计算车船税 */
         TAX_FLAG: "1",
         /** 新车购置价 */
         VHL_VAL: "920500",
         /** 新车购置价浮动值 */
         VHL_VAL_FLOAT: "990500",
         /** 验车情况*/
         CHK_CDE: "305005003",
         /**  核定载客数*/
         SET_NUM: "5",
         /**是否购买商业险*/
         SY_ORIG_FLG: true,
         /**是否购买较强险*/
         JQ_ORIG_FLG: false,
         /** 险种集合 */
         CVRG_LIST: [
            //1.车辆损失险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "0",
               /** 车损绝对免赔额 */
               C_YL15: ""
            },
            //2.第三者责任险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "50000",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: ""
            },
            //3.全车盗抢险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: ""
            },
            //4.司机座位险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "10000",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: ""
            },
            //5.乘客座位险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "10000",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: ""
            },
            //6.玻璃单独破碎险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
               /** 防弹玻璃(0 否,1 是) */
               BULLET_GLASS: "0"
            },
            //7.自燃损失险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //8.新增设备损失险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //9.车身划痕损失险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //10.发动机涉水损失险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //11.修理期间费用补偿险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //12.车上货物责任险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //13.精神损害抚慰金责任险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //14.车辆损失保险无法找到第三方特约险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //15.指定修理厂险
            {
               //购买标记
               PURCHASE_FLAG: false,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            },
            //16.交强险
            {
               //购买标记
               PURCHASE_FLAG: true,
               /** 险种代码 */
               INSRNC_CDE: "",
               /** 保险金额/赔偿限额(元） */
               AMT: "",
               /** 不计免赔(0:否 1：是) */
               FRANCHISE_FLAG: "",
            }
         ],
         /** 车型数据*/
         VHL_DATA: {
            "BRAND_NAME": "奥迪",
            "CAR_MAKER": "德国奥迪汽车股份有限公司",
            "CAR_PRICE": "920500",
            "CAR_REMARK": "手自一体 舒适型 245kw",
            "CAR_SORT": "轿车类",
            "CAR_STYLE": "进口车",
            "DESCRIBE": "2012款 奥迪 A8 AUDI A8L 50TFSI QUATTRO轿车 手自一体 舒适型 245kw 5座 3.0L",
            "DISPLACEMENT": "2.995",
            "FAMILY_NAME": "A8",
            "FUELFLAG": "0",
            "MARKET_YEAR": "201208",
            "MODEL": "",
            "MODEL_CODE": "ADI1230DGA",
            "MODEL_NAME": "AUDI A8L 50TFSI QUATTRO轿车",
            "NEW_ENERGY_FLAG": "",
            "QUALITY": "2075",
            "RISK_NAME": "正常车型",
            "RUN_NAME": "奥迪A8L 3.0T AT舒适型",
            "SET_NUM": "5",
            "TONNAGE": "",
            "VEHICLE_PRICE": "999200"
         },
         //--------------------------------------end  报价信息--------------------------------------/

         /** 退回修改标志 **/
         BU: "N",
         /**  车辆来历凭证种类  */
         CERTIFICATE_TYPE: "01",
         /** 保存草稿箱时间   */
         insertTime: "2016-11-04 12:50:05",
         /**  影像补传标志  */
         IS_IMAGE: "0",
         /**  是否传二类专修厂特约  */
         REFLAG: "0"
      };


      //保费计算 返回数据结构
      $rootScope.CALCOST_RESULT = {
         CALCOST_FLAG:false,
         SY_BASE: { //商业险
            //保额合计
            AMOUNT: "0",
            //保费合计
            PREMIUM: "0",
            //报价单号
            CAL_APP_NO: ""
         },
         JQ_BASE: { //交强险
            //保额合计
            AMOUNT: "0",
            //保费合计
            PREMIUM: "0",
            //报价单号
            CAL_APP_NO: ""
         },
         VHLTAX: { //车船税
            //上年应缴
            FORMER_TAX: "0",
            //当年应缴
            CURRENT_TAX: "0",
            //减免金额
            MINUS_TAX_AMT: "0",
            //合计
            SUM_UP_TAX: "0"
         },
         //保费明细
         CVRG_DETAIL:{}
      };
      return {};
   }]);
});